#1
'求出L这个列表的中位数，并输出'
L = [98, 78, 15, 30, 87, 36, 22, 3, 74, 61, 38, 68, 52, 10, 16, 15, 5, 39, 22, 97]
L.sort()
a=(L[9]+L[10])/2
print(a)
#2
'L1和L2合并后，求出其中位数并输出'
l1= [98, 78, 15, 30, 87, 36, 22, 3, 74, 61, 38, 68, 52, 10, 16, 15, 5, 39, 22, 97]
l2 = [66, 43, 61, 70, 26, 94, 14, 7, 85, 81, 25, 71, 77, 90, 52, 5, 76, 14, 15, 37]
l1.extend(l2)
a=(l1[19]+l1[20])/2
print(a)
#3
'筛选出L中大于等于50的数，筛选出L2所有的质数，然后把两个筛选结果合并，并从小到大输出'
l = [98, 78, 15, 30, 87, 36, 22, 3, 74, 61, 38, 68, 52, 10, 16, 15, 5, 39, 22, 97]
l2 = [66, 43, 61, 70, 26, 94, 14, 7, 85, 81, 25, 71, 77, 90, 52, 5, 76, 14, 15, 37]
l=[i for i in l if i>=50]
def is_need(n):
    a=True
    for i in range (2,n):
        if n%i==0:
            a=False
    return a
l2=[i for i in l2 if is_need(i)==True]
l2.extend(l)
print(sorted(l2))
#4
'''
leetcode 第1题：
https://leetcode-cn.com/problems/two-sum/description/
给定一个整数数组和一个目标值，找出数组中和为目标值的两个数。

你可以假设每个输入只对应一种答案，且同样的元素不能被重复利用。

示例:

给定 nums = [2, 7, 11, 15], target = 9

因为 nums[0] + nums[1] = 2 + 7 = 9
所以返回 [0, 1]

请算出下面nums可以相加等于61的两个数，并存入列表
'''
nums = [98, 78, 51, 30, 22, 36, 22, 3, 74, 61, 38, 68, 31, 10, 16, 15, 5, 39, 22, 97]
target = 61
list1=[]
for i in range(len(nums)):
    for j in range(i,len(nums)-1-i):
        if nums[i]+nums[j+1]==61:
            list1.append(i)
            list1.append(j+1)
print(list1)